package com.walking.intensive.chapter4.task16;

import java.util.Arrays;

/**
 * После завершения интенсива вы достаточно быстро познакомитесь с Java Collection Framework.
 * Это знакомство позволит сильно упростить работу с массивами данных.
 *
 * <p>Но пока этого не произошло - даже типовые операции приходится производить вручную.
 * Эта задача - наглядная тому демонстрация.
 *
 * <p>Удачи!
 *
 * <p>P.S. Обратите внимание: если в методе требуется как-то изменять
 * содержимое массива - метод всегда должен возвращать новый массив.
 * Массивы, передаваемые в параметрах, изменяться не должны.
 * Это связано с тем, что в реальных условиях такой входящий массив может далее
 * использоваться в каких-либо иных расчетах и ожидается, что он будет находиться
 * в своем исходном состоянии.
 *
 * <p><a href="https://github.com/KFalcon2022/intensive-tasks-2024/blob/master/README.md">Требования к оформлению</a>
 */
public class Task16 {
    public static void main(String[] args) {
        int[] arr1 = {4, 3, 5, 6, 7, 8};
        int[] arr2 = {5, 11, 1};
        int[] emptyArray = {};

        System.out.println("Одинаковая длина: " + isEqualSize(arr1, arr2)); // ok
        System.out.println("Полностью идентичны: " + isEquals(arr1, arr2)); // ok
        System.out.println("Увеличили на единицу: " + Arrays.toString(incrementEach(emptyArray))); // ok
        System.out.println("Перемноженный массив: " + Arrays.toString(multiplyEach(arr1, arr2))); //
//        System.out.println("Массив после вычитания: " + Arrays.toString(subtractEach(arr1, arr2))); //пока не работает
        System.out.println("Массив в реверсивном порядке: " + Arrays.toString(reverse(arr1))); //
        System.out.println("После добавления целого числа: " + Arrays.toString(add(arr1, 2, 455)));
        System.out.println(("Содержит ли число: " + isContains(arr1, 6)));
        System.out.println(("Минимальный совпадающий индекс: " + getFirstIndex(arr1, 6)));
        System.out.println(("Максимальный совпадающий индекс: " + getLastIndex(arr1, -24)));
        System.out.println("После удаления числа: " + Arrays.toString(removeByIndex(arr1, 2))); // косяк?
        System.out.println("Со смещённым индексом: " + Arrays.toString(shiftIndex(arr1)));
    }

    /**
     * Реализуйте метод, который будет возвращать true,
     * если массивы не пустые и имеют одинаковую длину.
     * В остальных случаях - false.
     */
    static boolean isEqualSize(int[] arr1, int[] arr2) {
        if (isEmpty(arr1)) { // Достаточно проверить один массив!
            return false;
        }

        return arr1.length == arr2.length;
    }

    /**
     * Реализуйте метод, который будет возвращать true,
     * если массивы полностью идентичны по составу.
     * В остальных случаях - false.
     *
     * <p>Идентичными считаются массивы одинаковой длины, для которых arr1[i] == arr2[i] для любого i.
     */
    static boolean isEquals(int[] arr1, int[] arr2) {
        if (arr1.length != arr2.length) {
            return false;
        }

        for (int i = 0; i < arr1.length; i++) {
            if (arr1[i] != arr2[i]) {

                return false;
            }
        }

        return true;
    }

    /**
     * Реализуйте метод, который принимает параметром массив целых чисел.
     * И возвращает массив, в котором каждый элемент исходного увеличен на единицу.
     *
     * <p>Для пустого массива должен быть возвращен пустой массив.
     *
     * <p>Пример:
     *
     * <p>Входные данные: [10,20,30,40,50,20,60]
     *
     * <p>Возвращаемое значение: [11,21,31,41,51,21,61]
     */
    static int[] incrementEach(int[] arr) {
        int[] incrementedArray = new int[arr.length];

        for (int i = 0; i < arr.length; i++) {
            incrementedArray[i] = arr[i] + 1;
        }

        return incrementedArray;
    }

    /**
     * Реализуйте метод, который принимает параметрами два массива целых чисел: arr1 и arr2.
     * И возвращает массив, в котором каждый result[i] - произведение arr1[i] и arr2[i].
     *
     * <p>Если массивы разной длины - недостающие значения более короткого
     * массива необходимо считать как 0.
     *
     * <p>В случае с двумя пустыми массивами необходимо вернуть пустой массив.
     *
     * <p>Пример:
     *
     * <p>Входные данные: [2,3,4], [4,5,6]
     *
     * <p>Возвращаемое значение: [8,15,24]
     */
    static int[] multiplyEach(int[] arr1, int[] arr2) {
        if (arr1.length > arr2.length) {
            return multiplyEach(arr2, arr1);
        }

        int[] multipliedArray = new int[arr2.length];

        if (arr1.length == 0) {
            return multipliedArray;
        }

        for (int i = 0; i < arr1.length; i++) {
            multipliedArray[i] = arr1[i] * arr2[i];
        }

        return multipliedArray;
    }

    /**
     * Реализуйте метод, который принимает параметрами два массива целых чисел: arr1 и arr2.
     * И возвращает массив, в котором каждый result[i] - разность arr1[i] и arr2[i].
     *
     * <p>Если массивы разной длины - недостающие значения более короткого
     * массива необходимо считать как 0.
     *
     * <p>В случае с двумя пустыми массивами необходимо вернуть пустой массив.
     *
     * <p>Пример:
     *
     * <p>Входные данные: [2,3,6], [4,5,4]
     *
     * <p>Возвращаемое значение: [-2,-2,2]
     */
    static int[] subtractEach(int[] arr1, int[] arr2) {
        int[] subtractedArray = arr1.length <= arr2.length
                ? new int[arr2.length]
                : new int[arr1.length];

        for (int i = 0; i < subtractedArray.length; i++) {
            if (i == arr1.length) {
                subtractedArray[i] = arr1[i] - arr2[i];
            } else if (i < arr1.length) {
                subtractedArray[i] = -arr2[i];
            } else {
                subtractedArray[i] = arr1[i];
            }
        }

        return subtractedArray;
    }

    /**
     * Реализуйте метод, который принимает параметром массив целых чисел.
     * И возвращает массив, развернутый в обратном порядке.
     *
     * <p>Для пустого массива должен быть возвращен пустой массив.
     *
     * <p>Пример:
     *
     * <p>Входные данные: [2,3,4],
     *
     * <p>Возвращаемое значение: [4,3,2]
     */
    static int[] reverse(int[] arr) {
        int[] reversedArray = new int[arr.length];
        for (int i = 0; i < arr.length; i++) {
            reversedArray[i] = arr[arr.length - 1 - i];
        }

        return reversedArray;
    }

    /**
     * Реализуйте метод, который принимает параметрами массив целых чисел, индекс массива и целое число.
     * И возвращает массив, в котором число вставлено по указанному индексу в исходный массив.
     * Остальные элементы массива должны быть сдвинуты вправо.
     *
     * <p>Если индекс превышает длину массива - число добавляется в конец массива.
     * Если индекс некорректный (например, отрицательный), метод должен вернуть пустой массив.
     *
     * <p>Пример:
     *
     * <p>Входные данные: [1,2,3,4], 2, 456
     *
     * <p>Возвращаемое значение: [1,2,456,3,4]
     */
    static int[] add(int[] arr, int index, int newValue) {
        if (index < 0) {
            return new int[0];
        }

        int[] addedArr = new int[arr.length + 1];

        if (index >= arr.length) {
            for (int i = 0; i < arr.length; i++) {
                addedArr[i] = arr[i];
            }
            addedArr[arr.length] = newValue;

        } else {
            int i = 0;
            while (i < index) {
                addedArr[i] = arr[i];
                i++;
            }
            addedArr[index] = newValue;

            for (int j = index + 1; j < addedArr.length; j++) {
                addedArr[j] = arr[j - 1];
            }
        }

        return addedArr;
    }

    /**
     * Реализуйте метод, который будет возвращать true,
     * если переданный параметром массив содержит указанное число.
     * В остальных случаях - false.
     */
    static boolean isContains(int[] arr, int value) {
        for (int i : arr) {
            if (value == i) {
                return true;
            }
        }

        return false;
    }

    /**
     * Реализуйте метод, который принимает параметрами массив целых чисел и искомое целое число.
     * И возвращает минимальный индекс, на котором найдет данное число в массиве.
     *
     * <p>Если в массиве нет искомого элемента - метод должен вернуть -1.
     *
     * <p>Пример 1:
     *
     * <ul>
     * <li>Входные данные: [10,20,30,40,50,20,60], 20
     * <li>Возвращаемое значение: 1
     * </ul>
     *
     * <p>Пример 2:
     *
     * <ul>
     * <li>Входные данные: [10,30,40,50,60], 20
     * <li>Возвращаемое значение: -1
     * </ul>
     */
    static int getFirstIndex(int[] arr, int value) {
        for (int i = 0; i < arr.length; i++) {
            if (value == arr[i]) {
                return i;
            }
        }

        return -1;
    }

    /**
     * Реализуйте метод, который принимает параметрами массив целых чисел и искомое целое число.
     * И возвращает максимальный индекс, на котором найдет данное число в массиве.
     *
     * <p>Если в массиве нет искомого элемента - метод должен вернуть -1.
     *
     * <p>Пример 1:
     *
     * <ul>
     * <li>Входные данные: [10,20,30,40,50,20,60], 20
     * <li>Возвращаемое значение: 5
     * </ul>
     *
     * <p>Пример 2:
     *
     * <ul>
     * <li>Входные данные: [10,30,40,50,60], 20
     * <li>Возвращаемое значение: -1
     * </ul>
     */
    static int getLastIndex(int[] arr, int value) {
        for (int i = arr.length - 1; i >= 0; i--) {
            if (arr[i] == value) {
                return i;
            }
        }

        return -1;
    }

    /**
     * Реализуйте метод, который принимает параметрами массив целых чисел и целое число - индекс.
     * И возвращает массив без значения по указанному индексу. Другие значения должны быть сдвинуты влево.
     *
     * <p>Если указанный индекс выходит за пределы массива - метод должен вернуть копию исходного массива.
     * Если индекс некорректный - метод должен вернуть пустой массив.
     *
     * <p>Пример:
     *
     * <p>Входные данные: [10,20,30,40,50,20,60], 2
     * <p>Возвращаемое значение: [10,20,40,50,20,60]
     */
    static int[] removeByIndex(int[] arr, int index) {
        if (index < 0) {
            return new int[0];
        }
        int[] removedArr = index < arr.length
                ? new int[arr.length - 1]
                : new int[arr.length];

        if (index >= arr.length) {
            for (int i = 0; i < arr.length; i++) {
                removedArr[i] = arr[i];
            }
            return removedArr;
        }

        for (int i = 0; i < removedArr.length; i++) {
            if (i != index) {
                removedArr[i] = arr[i];
            } else {
                removedArr[i] = arr[i + 1];
            }
        }

        return removedArr;
    }

    /**
     * Реализуйте метод, который принимает параметрами массив целых чисел и
     * еще один массив целых чисел (в виде varargs).
     * И возвращает первый массив, удалив из него все числа, которые есть во втором.
     *
     * <p>Пример:
     *
     * <p>Входные данные: [10,20,30,40,50,20,60], [20,23,30]
     * <p>Возвращаемое значение: [10,40,50,60]
     */
    static int[] removeAll(int[] arr, int... removingValues) {
        // Ваш код
        return null;
    }

    /**
     * Реализуйте метод, который будет возвращать true,
     * если все числа из первого массива присутствуют во втором
     * и все числа из второго массива присутствуют в первом.
     * При этом индексы элементов могут не совпадать.
     */
    static boolean isSimilar(int[] arr1, int[] arr2) {
        // Ваш код
        return false;
    }

    /**
     * Реализуйте метод, который принимает параметром массив целых чисел.
     * И возвращает массив, сдвинув все элементы входящего массива на следующий индекс.
     * При этом последний элемент будет перенесен на нулевой индекс.
     *
     * <p> Для пустого массива должен быть возвращен пустой массив.
     *
     * <p>Пример:
     *
     * <p>Входные данные: [1,2,3,4]
     * <p>Возвращаемое значение: [4,1,2,3]
     */
    static int[] shiftIndex(int[] arr) {
        if (isEmpty(arr)) {
            return new int[0];
        }

        int[] shiftedArray = new int[arr.length];
        shiftedArray[0] = arr[arr.length - 1];
        for (int i = 1; i < arr.length; i++) {
            shiftedArray[i] = arr[i-1];
        }

        return shiftedArray;
    }

    static boolean isEmpty(int[] array) {
        return array.length == 0;
    }
}
